"""Зробити такі вибірки з отриманої бази даних:

01. Знайти 5 студентів із найбільшим середнім балом з усіх предметів.
02. Знайти студента із найвищим середнім балом з певного предмета.
03. Знайти середній бал у групах з певного предмета.
04. Знайти середній бал на потоці (по всій таблиці оцінок).
05. Знайти які курси читає певний викладач.
06. Знайти список студентів у певній групі.
07. Знайти оцінки студентів у окремій групі з певного предмета.
08. Знайти середній бал, який ставить певний викладач зі своїх предметів.
09. Знайти список курсів, які відвідує студент.
10. Список курсів, які певному студенту читає певний викладач.
Для кожного запиту оформити окремий файл query_number.sql, 
де замість number підставити номер запиту. 
Файл містить SQL інструкцію, яку можна виконати як у терміналі бази даних, 
так і через cursor.execute(sql)

Додаткове завдання

11. Середній бал, який певний викладач ставить певному студентові.
12. Оцінки студентів у певній групі з певного предмета на останньому занятті."""

import sqlite3
from constants_db import NAME_DB
from colors import GREEN, RESET, GREEN_BACK


def run_queries(db_name=NAME_DB):
    """run all queries from 1 to 12"""
    with sqlite3.connect(db_name) as con:
        cur = con.cursor()
        for query_number in range(0+1, 12+1):
            print(f"{GREEN_BACK} Query number: {query_number} {RESET}", end="")
            with open(f"query_{query_number:02}.sql", encoding="utf-8") as file:
                sql = file.read()
            cur.execute(sql)
            print(GREEN, sql.split("\n")[0], RESET)
            result = cur.fetchall()
            print(result)


if __name__ == "__main__":
    run_queries()
